<script type="application/ld+json">
{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [

    {
      "@type": "Question",
      "name": "Do I have to be referred by a doctor?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "No, speech therapists can provide assessments and treatment without a doctor’s referral.\n\nHowever, some health insurers require a referral from your child’s primary physician before they will provide coverage."
      }
    },
    {
      "@type": "Question",
      "name": "How do I get started?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "You have two ways; Meet & Greet or Initial Evaluation. The Meet & Greet is a free 20 minute video chat where we can get to know each other. You can voice your concerns, and determine if Teletherapy is right for your family. \n\nBut If you already know you’d like an assessment, and want to get on the schedule faster, book an Initial Evaluation. Use the online scheduling system for both.  Please reach me at heather@bravospeechtherapy.com with any questions."
      }
    },
    {
      "@type": "Question",
      "name": "Do you have a waiting list? How long does it take to get an appointment?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "I often experience a high demand for after-school appointments and may have a waiting list for 3:00pm or 4:00pm appointments.\n\nYou can use the online scheduling system to request a Meet & Greet or Initial Evaluation."
      }
    },
    {
      "@type": "Question",
      "name": "Where are your services offered?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "I am currently licensed to provide services to families residing in Washington State.\n\nServices will be available to residents of Oregon and California soon."
      }
    },
    {
      "@type": "Question",
      "name": "How old are the kids you see?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "I offer speech and language services to children between the ages of 18 months to 18 years"
      }
    },
    {
      "@type": "Question",
      "name": "What are your specialty areas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "I help children with..\n\nDown Syndrome\nAutism Spectrum\nDown Syndrome\nGenetic Disorders\nSocial Skills\nCommunication Skills\nSpeech Delays\nArticulation Disorders\nMotor Speech/Apraxia\nLanguage Comprehension\nStuttering and more..."
      }
    },
    {
      "@type": "Question",
      "name": "Does my child need to have an Evaluation first? What if they’ve had one recently somewhere else?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "If your child has been evaluated by another certified speech-language pathologist within the last year, I can review it. This will determine if there is adequate information to be able to establish a plan and begin treatment, without conducting another evaluation."
      }
    },
    {
      "@type": "Question",
      "name": "How long does a Speech Evaluation take? What if you need more time to assess my child?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The Initial Evaluation allows 90 minutes to assess multiple areas for an accurate understanding of your child's skills. Test scores may not be obtained within that timeframe, but I can still create a treatment plan using other sources like parent reports, clinical observation, and oral motor exams. \n\nAssessment of your child’s progress is an ongoing process and I continue it throughout your child’s plan of care."
      }
    },
    {
      "@type": "Question",
      "name": "I work 5 days a week, how will I practice at home with my child?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "I'll help you incorporate home practice into your daily routine! With my suggestions, your child's skills will transfer more easily in your home, community, and other settings. \n\nFor example, you can write 5 speech words on a sticky note and say them before or after brushing teeth each night. Encourage your child to do this 7 days a week and you’ve helped them practice 40 times that week!"
      }
    },
    {
      "@type": "Question",
      "name": "Do you provide a written report of my child’s progress?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, I provide a comprehensive written report of your child’s Initial Assessment which includes background information/parent concerns, test scores, clinical observations, long and short-term goals, a general plan of care, and therapy recommendations. Then, a 6 month Progress Report with updates on goals will be written, and after 12 months, a Re-Evaluation will be completed."
      }
    },
    {
      "@type": "Question",
      "name": "Do you help children with swallowing and feeding issues?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "No, I do not provide swallowing or feeding therapy at this time. I’m happy to pass along a referral in your area, if needed."
      }
    },
    {
      "@type": "Question",
      "name": "How many days a week does my child need therapy?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The number of sessions per week will vary depending on your child’s needs. Typical frequency of treatment is 1x/week at 45 minutes in length.After a thorough assessment, I will develop your child’s treatment plan and determine frequency."
      }
    },
    {
      "@type": "Question",
      "name": "What is a Speech-Language Pathologist?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "A Speech-Language Pathologist (also known as SLP or Speech Therapist), is an expert in communication who holds a masters degree in an accredited program. SLPs prevent, assess, and treat adults and children who experience problems with; speech sounds, language skills, social communication, voice, fluency, feeding and swallowing."
      }
    },
    {
      "@type": "Question",
      "name": "Does Teletherapy work?\n",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "My clients are often surprised at just how well online speech therapy works for them. Studies show that it achieves the same or better results as in-person treatment.\n\nBeing present inside your child's home environment offers me valuable insight, and more directly connects parent involvement!"
      }
    },
    {
      "@type": "Question",
      "name": "What technology or equipment do I need for Teletherapy?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "- High speed internet connection\n\n- Computer or laptop preferred (Ipad or mobile device can be an alternative option)\n\n- You don’t need any extra special equipment"
      }
    },
    {
      "@type": "Question",
      "name": "Do you provide In-Person services also?\n",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "No, Bravo Online Speech Therapy is a Teletherapy only practice."
      }
    },
    {
      "@type": "Question",
      "name": "How is Teletherapy different than In-Person therapy?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Not much different at all actually! This is my specialty, and the pure mission of Bravo! Speech Therapy. \n\nI use many of the same materials (toys, games, books, etc) that I would use in an In-Person session. I provide individualized evaluation and treatment with the same quality of care. You, as the parent, will have a stronger presence during Teletherapy sessions, assisting your child for improved motivation and participation.\n\nYour involvement allows for an ease in carryover of your child’s skills into the home setting. As your therapist, being able to have a window into your child’s natural environment gives me a unique and valuable perspective. This allows me to provide a more individualized plan of care for your family."
      }
    },
    {
      "@type": "Question",
      "name": "What are the benefits of Teletherapy?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Teletherapy allows for more flexibility in scheduling, ease in carryover of home practice, and prompt communication with Heather during the session. All of this can add up to more effective therapy for your child.\n\nPeople also enjoy being in the comfort of their own home, and decreased travel time."
      }
    },
    {
      "@type": "Question",
      "name": "How does Bravo protect my personal health information?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "As a professional SLP of 14 years, I take privacy seriously. \n\n\n\nBravo Online Speech Therapy LLC protects personal health information by adhering to strict confidentiality policies and taking necessary precautions to safeguard the information from unauthorized access or disclosure.\n\nBravo maintains a secure, fully HIPAA compliant data storage system via SimplePractice platform."
      }
    },
    {
      "@type": "Question",
      "name": "Do you accept insurance?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "No, I don’t accept insurance currently. Bravo accepts private pay clients only. Upon request, I can provide you a 'Superbill' that is formatted for insurance companies to provide coverage retroactively."
      }
    },
    {
      "@type": "Question",
      "name": "How much does Bravo Online Speech Therapy cost?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "- 20 minute Meet & Greet = no cost\n- 90 minute Initial Evaluation + written report = $150\n- 45 minute Treatment Session + home programming = $90"
      }
    },
    {
      "@type": "Question",
      "name": "How do I pay for services?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Private payment for speech services is made via credit card through Bravo’s payment processor (Stripe). After you’ve scheduled your Initial Evaluation, you will complete required paperwork in your client portal. You will fill out your credit card information and sign a form to authorize payments via credit card."
      }
    },
    {
      "@type": "Question",
      "name": "When does my payment get processed?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Payment will be processed at the completion of each therapy session."
      }
    },
    {
      "@type": "Question",
      "name": "How do I know if my credit card has been charged?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Soon after your credit card is charged, you will receive an updated invoice detailing service and payment information. The invoice will be available to you in your client portal."
      }
    },
    {
      "@type": "Question",
      "name": "What is a Superbill?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "A Superbill is a document provided to you containing information you need, to work directly with your insurance plan.\n\nIt is different from a typical invoice or receipt because it provides additional information, including; Client’s contact information, speech therapist name and credentials, CPT code for the service, ICD-10 code for diagnosis, fee for the service paid by the client, and more."
      }
    },
    {
      "@type": "Question",
      "name": "How and when do I get a Superbill?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "A Superbill can be provided at any time after your child’s completed service. You can then fill it out and submit it to your insurance company for possible reimbursement."
      }
    },
    {
      "@type": "Question",
      "name": "My two year old isn’t talking yet. What do I do?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Early intervention with a therapist is best, to learn how your child can improve their speech skills. \n\nYou can also practice with your child at home by responding positively to all of their communication attempts; repeating what they do/say or giving verbal praise 'I like how you tried to tell me!'."
      }
    },
    {
      "@type": "Question",
      "name": "When do babies start talking?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Babies aged 7 months to 1 year are babbling long strings of sounds, like bababa, mamama, dadada. They begin saying a few meaningful words around age 1 to express themselves, like dada, mama, dog, hi, up. The ‘words’ they try to say may not be clear to the listener, as many sounds are still developing. \n\nBy 18 months, a child is speaking anywhere between 20 to 200 words. This can vary greatly from child to child, as some children spend more of their developmental energy on motor or other communication skills.\n\nConsult an SLP if your child does not speak at least 50-75 words by 2 years old."
      }
    },
    {
      "@type": "Question",
      "name": "My older daughter spoke in full sentences at age two but my son is still babbling. Is this normal?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "It’s common to compare your older child to your younger child, however, every child develops at a different speed! Boys tend to develop a little slower than girls, but this difference is very insignificant. \n\nIf you have concerns for your younger child, having an evaluation done is a great way to discover if they’re in need of speech therapy. Learning more can be helpful in decreasing worry you may feel. "
      }
    },
    {
      "@type": "Question",
      "name": "My child has a lisp. What should we do?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "A frontal lisp is when the tongue pokes out between the front teeth (sometimes sounding like a ‘th’ sound). This type of lisp is considered normal in children until about age 4 ½  years. It may be appropriate to treat this type of lisp earlier than 4 ½ depending on the child’s abilities, speech understandability, etc. A speech evaluation can be a great way to determine if therapy is recommended.\n\nA lateral lisp is when the air travels across the sides of the tongue and escapes into the cheeks, making a ‘slushy’ sound. This type of lisp is not considered part of normal development and should be treated as soon as possible. I recommended scheduling an appointment right away to determine if treatment is needed. "
      }
    },
    {
      "@type": "Question",
      "name": "Should I worry if my child stutters?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Some types of disfluencies (stuttering) are considered typical at certain ages and there’s no need to worry. Stuttering typically begins around 2-6 years of age, lasting less than 6 months. It usually presents as repeated phrases or words with little to no awareness, and during a natural peak in speech-language development. \n\nOftentimes disfluencies increase when a child is tired, excited, or feeling rushed. However, an evaluation is recommended if your child’s stuttering increases, they exhibit frustration or avoidance in speaking situations, they tense up their face or body when speaking, or there is a family history of stuttering."
      }
    },
    {
      "@type": "Question",
      "name": "Does my child need a hearing test?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Your child’s hearing is an important part of speech-language development and should be tested if you have concerns. \n\nSeek an appointment with a certified Audiologist if your child exhibits the following warning signs; not responding to loud background noise, not responding to their name being called, reduced verbal speech skills or development, preferring the TV to be very loud."
      }
    },
    {
      "@type": "Question",
      "name": "If I use sign language with my child, will it stop my child from trying to talk?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Using sign language, or gestures, with any child will not inhibit their verbal speech. In fact, it could even enhance your child’s ability to communicate. \n\nCurrent research shows that providing your child with a different/alternative way to express themselves (sign language, gestures), can decrease communication frustration (reduced meltdowns) and may actually improve motivation for verbal communication.\n\n\n\nChat with me if you’d like to discuss further!"
      }
    },
    {
      "@type": "Question",
      "name": "How long does my child need therapy to meet their goals? Weeks? Months? Years?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Each child’s plan of care is unique to them. Some children require an Initial Evaluation only, followed by home recommendations to the family. But for many, treatment sessions are recommended.\n\nThe duration of therapy depends on many factors; severity of the child’s difficulties, diagnosis, health history, and progress in therapy."
      }
    },
    {
      "@type": "Question",
      "name": "Can my child be seen by Early Intervention (birth to 3) or school services AND see you online?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes! Bravo Online Speech Therapy is a private pay service and separate from school services. Getting private therapy in tandem with existing services through your school district can be very beneficial!\n\nSchool therapy focuses more on communication skills as they relate to the educational setting, whereas private therapy can focus on more functional communication needs in home and community settings.\n\nI work collaboratively with your school speech therapist to make sure therapy goals are in alignment with your child's plan of care."
      }
    }
  ]
}
</script>
<!--FAQPage Code Generated by https://saijogeorge.com/json-ld-schema-generator/faq/-->
